Reports/КонтрольПроектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>КонтрольПроектов</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/НастройкиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерНастройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Б24_СМ_ИдентификаторыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Б24_СМ_ИдентификаторыОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Портал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипВладельцаСмартПроцесса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдСмартПроцесса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСущности1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сущность1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДатыКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыКомплекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БезГабаритногоЧертежа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЗамера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейРКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейТЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Код_в_PDM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_ПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_РКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_ТЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаДоработки_ПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаДоработки_РКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокМонтажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПроектирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПроизводства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДатыКомплектаПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыКомплектаПроизводство</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайСтолярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайМалярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайПодрядчик</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоСтолярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоМалярка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоПодрядчик</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремениПроизводства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДатыКомплектаМонтаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыКомплектаМонтаж</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КрайМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремениМонтажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСотрудниковМонтаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/КонтрольПроектов/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область СобытияФормы

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьГруппировки();
	ОбновитьНаСервере();
	ЗаполнитьЦветаЛегенды();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Диаграмма.ОтображатьЛегенду = Ложь;
КонецПроцедуры

#КонецОбласти 
	

#Область Команды

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ОткрытьФорму("Отчет.КонтрольПроекта.Форма.ФормаПечати",
		Новый Структура("Проект,тзЗадачи,тзКомплекты,тзДатыОкончания",Проект,ТЗЗадачи,тзКомплекты,тзДатыОкончания));
КонецПроцедуры

#КонецОбласти 


#Область СобытиеРеквизитов

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КонструкторПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры

#КонецОбласти 


#Область СобытиеРеквизитовПродолжение

&НаСервере
Процедура ОбновитьНаСервере()
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	
	СтруктураФильтры = Новый Структура("Группировки", Группировки.ВыгрузитьЗначения());
	СтруктураФильтры.Группировки.Добавить("Комплект"); 
	СтруктураФильтры.Вставить("Проект",		 Проект); 
	СтруктураФильтры.Вставить("Конструктор", Конструктор); 
	
	
	стДанные = омГантНаСервере.ПолучитьДанныеДляДиаграммы(Новый Структура("ДатаНачала, ДатаОкончания", Дата(1,1,1), Дата(2030,1,1)), СтруктураФильтры, "ПланРаботы");
	омГантНаСервере.ВывестиДиаграмуГанта(стДанные.ТаблицыДляДиаграммы, стДанные.СтруктураФильтры, Диаграмма);

	Диаграмма.Обновление = Истина;
КонецПроцедуры 

#КонецОбласти 


#Область Группировки

Процедура ЗаполнитьГруппировки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки
		|	И НастройкиПроекта.Пользователь = &Пользователь
		|
		|УПОРЯДОЧИТЬ ПО
		|	НастройкиПроекта.НомерНастройки";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ПолучитьИмяНастройки());
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	Группировки.ЗагрузитьЗначения(
								Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Значение"));
								
	Для каждого х Из Группировки Цикл
		х.Представление = СтрЗаменить(х.Значение, "_", " ");
	КонецЦикла;							
	
КонецПроцедуры 

Функция ПолучитьИмяНастройки()
	Возврат "ГруппировкиГанта"; 
КонецФункции // ПолучитьИмяНастройки()

&НаКлиенте
Процедура ГруппировкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Элементы.Группировки.СписокВыбора.Очистить();
	Для каждого ВариантыГруппировки Из омГантНастройкиКлиентСервер.ПолучитьГруппировки() Цикл
		Если Группировки.НайтиПоЗначению(ВариантыГруппировки) = Неопределено Тогда
			Элементы.Группировки.СписокВыбора.Добавить(ВариантыГруппировки);
		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкиПриИзменении(Элемент)
	ИзменениеГруппировкиНаСервере();
КонецПроцедуры

Процедура ИзменениеГруппировкиНаСервере()
	ЗаписатьГруппировки();
	ОбновитьНаСервере();

КонецПроцедуры

Процедура ЗаписатьГруппировки()
	
	ИмяНастройки = ПолучитьИмяНастройки(); 
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	НаборЗаписей = РегистрыСведений.НастройкиПроекта.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИмяНастройки.Установить(ИмяНастройки);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	
	НомерНастройки = 1;
	Для каждого ТекущиеИмяГруппировки Из Группировки Цикл
		НоваяЗапись 				= НаборЗаписей.Добавить();
		НоваяЗапись.Значение 		= ТекущиеИмяГруппировки.Значение;
		НоваяЗапись.ИмяНастройки 	= ИмяНастройки;
		НоваяЗапись.НомерНастройки 	= НомерНастройки;
		НоваяЗапись.Пользователь 	= Пользователь;
		
		НомерНастройки = НомерНастройки + 1;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти 


#Область СобытияДиаграммы
	
&НаКлиенте
Процедура ДиаграммаПриОкончанииРедактированияИнтервала(Элемент, Интервал, ОтменаРедактирования)
	//Если СтрНайти(Интервал.Текст, "Сделка") > 0 ИЛИ СтрНайти(Интервал.Текст, "Окончание с запасом") > 0 Тогда	
	//	ОтменаРедактирования = Истина;
	//Иначе
	//	
	//	СсылкаКомплект = Интервал.Расшифровка.СсылкаКомплект;
	//	Если НЕ ЗначениеЗаполнено(СсылкаКомплект) Тогда
	//		ОтменаРедактирования = Истина;
	//		Возврат;
	//	КонецЕсли;
	//	
	//	ТипКомплекта = ТипЗнч(СсылкаКомплект);
	//	Если ТипКомплекта = Тип("СправочникСсылка.ИзделияКомплект") Тогда
	//		стОтбор = Новый Структура("Комплект", Интервал.Расшифровка.СсылкаКомплект);
	//	Иначе
	//		Возврат;
	//	КонецЕсли;
	//	
	//	стОтбор.Вставить("Этап", Интервал.Расшифровка.Этап); 
	//	
	//	ИдентификаторИнтервала = ТЗЗадачи.НайтиСтроки(стОтбор);
	//	Если ИдентификаторИнтервала.Количество() = 0 Тогда
	//		ОтменаРедактирования = Истина;
	//		Возврат;
	//	КонецЕсли;
	//	
	//	строкаТЗЗадачи 	= ИдентификаторИнтервала[0]; 

	//	Интервал.Начало = НачалоДня(Интервал.Начало);
	//	Интервал.Конец 	= НачалоДня(Интервал.Конец);
	//	
	//	Интервал.Начало = омДаты.ДобавитьДниСУчетомВыходных(Интервал.Конец,-строкаТЗЗадачи.ПродолжительностьВДнях);
	//	
	//	СекундВдне = 24 * 3600;
	//	Если Интервал.Конец - Интервал.Начало < СекундВдне Тогда
	//	
	//		Интервал.Конец = Интервал.Начало + СекундВдне;	
	//	                           
	//	КонецЕсли;
	//	
	//	строкаТЗЗадачи.ДатаНачалаПлан 		= Интервал.Начало;
	//	строкаТЗЗадачи.ДатаОкончанияПлан 	= Интервал.Конец;
	//	строкаТЗЗадачи.Изменен 				= Истина;
	//	
	//	Если Типзнч(СсылкаКомплект) = Тип("СправочникСсылка.ИзделияКомплект") Тогда
	//		СсылкаИзделиеКомплект = СсылкаКомплект;
	//	КонецЕсли; 
	//	
	//	стИнтервалы = РасчитатьИнтервалы(Интервал.Расшифровка.Сделка, СсылкаИзделиеКомплект); 
	//	
	//	Серия = Диаграмма.Серии[0];
	//	
	//	МаксИндексСделок = Диаграмма.Точки.Количество() - 1;
	//	
	//	Для х = 0 По МаксИндексСделок Цикл
	//		Если Диаграмма.Точки[х].Значение = Интервал.Расшифровка.Сделка Тогда
	//			текТочка = Диаграмма.Точки[х];
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	ЗначениеСерия = Диаграмма.ПолучитьЗначение(текТочка, Серия);
	//	
	//	Для каждого х Из ЗначениеСерия Цикл
	//		х.Начало 	= стИнтервалы.НачалоСделка;
	//		х.Конец 	= стИнтервалы.КонецСделка;
	//	КонецЦикла;
	//	
	//	МаксИндексТочки = текТочка.Точки.Количество() - 1;
	//	Для х = 0 По МаксИндексТочки Цикл
	//		Если текТочка.Точки[х].Значение = СсылкаИзделиеКомплект Тогда
	//			ЗначениеКомплект = Диаграмма.ПолучитьЗначение(текТочка.Точки[х], Серия);
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
		
	//КонецЕсли;
КонецПроцедуры 


&НаКлиенте
Процедура ДиаграммаОбработкаРасшифровки(Элемент, Расшифровки, СтандартнаяОбработка, Дата)
	СтандартнаяОбработка = Ложь;
	Если Расшифровки.Количество() > 1 Тогда
		Если НЕ Расшифровки[1] = Неопределено Тогда
			Если Расшифровки[1].Свойство("СсылкаКомплект") Тогда
				СсылкаКомплект = Расшифровки[1].СсылкаКомплект;
				СрокиСделки = ДокументСрокиСделки(СсылкаКомплект, Расшифровки[1].Этап);
				ПоказатьЗначение(,СрокиСделки);	
			Иначе
				ПоказатьЗначение(,Расшифровки[1].Значение);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДокументСрокиСделки(СсылкаКомплект, Этап)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СрокиСделкиКомплекты.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗапускВРаботу.Комплекты КАК СрокиСделкиКомплекты
		|ГДЕ
		|	СрокиСделкиКомплекты.Комплект = &Комплект";
	
	Запрос.УстановитьПараметр("Комплект", СсылкаКомплект); 
	
	Если Этап = "Монтаж" Тогда
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗапускВРаботу", "СрокиПроектаМонтаж");	
	
	ИначеЕсли Этап = "Производство" Тогда
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗапускВРаботу", "СрокиПроектаПроизводство");	
	
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
	Возврат СсылкаКомплект;

КонецФункции // ДокументСрокиСделки()

&НаКлиенте
Процедура ДиаграммаВыбор(Элемент, Значения, СтандартнаяОбработка, Дата)
	Если Тип("ТочкаДиаграммыГанта") = ТипЗнч(Значения) Тогда
		Если Тип("СправочникСсылка.ИзделияКомплект") = ТипЗнч(Значения.Значение) Тогда
			СтандартнаяОбработка = Ложь;
			ПоказатьЗначение(,Значения.Значение);	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ДиаграммаПередСворачиванием(Элемент, ИдентификаторЗначения, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаПередРазворачиванием(Элемент, ИдентификаторЗначения, Отказ)
	диаграмма.НайтиЗначениеПоИдентификатору(ИдентификаторЗначения)
КонецПроцедуры
#КонецОбласти

#Область Запись
	
&НаСервереБезКонтекста
Процедура ЗаписатьНаСервере(мИзмененныеКомплекты)
	мИзделияКомплект 			= Новый Массив;
	мКонтроль = Новый Массив;
	ТипИзделияКомплект 			= Тип("СправочникСсылка.ИзделияКомплект");
	
	
	ОписаниеЦелоеЧисло 	= Новый ОписаниеТипов("Число", , ,Новый КвалификаторыЧисла(6, 0, ДопустимыйЗнак.Неотрицательный));
	ОписаниеСтрока40 	= Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(40));
	ОписаниеДата 		= Новый ОписаниеТипов("Дата");

	тзКомплекты = Новый ТаблицаЗначений;
	тзКомплекты.Колонки.Добавить("УИД", 				ОписаниеСтрока40);
	тзКомплекты.Колонки.Добавить("Комплект", 			Новый ОписаниеТипов("СправочникСсылка.ИзделияКомплект"));
	тзКомплекты.Колонки.Добавить("Проект", 				Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	тзКомплекты.Колонки.Добавить("Этап", 				ОписаниеСтрока40);
	тзКомплекты.Колонки.Добавить("ДатаНачалаПлан", 		ОписаниеДата);
	тзКомплекты.Колонки.Добавить("ДатаОкончанияПлан", 	ОписаниеДата);
	
	Для каждого текДанные Из мИзмененныеКомплекты Цикл       
		ТипКомплекта = типЗнч(текДанные.Комплект);
		
		Если ТипКомплекта = ТипИзделияКомплект Тогда
			НС 						= тзКомплекты.Добавить();
			НС.Комплект 			= текДанные.Комплект;
			НС.УИД 					= текДанные.Комплект.УникальныйИдентификатор();      
			НС.Этап					= текДанные.Этап;
			НС.ДатаНачалаПлан		= текДанные.ДатаНачалаПлан;
			НС.ДатаОкончанияПлан	= текДанные.ДатаОкончанияПлан;
		КонецЕсли;
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзКомплекты.УИД КАК УИД,
		|	тзКомплекты.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
		|	тзКомплекты.ДатаНачалаПлан КАК ДатаНачалаПлан,
		|	тзКомплекты.Этап КАК Этап,
		|	тзКомплекты.Комплект КАК Комплект
		|ПОМЕСТИТЬ тзКомплекты
		|ИЗ
		|	&тзКомплекты КАК тзКомплекты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тзКомплекты.Комплект КАК Комплект,
		|	тзКомплекты.Этап КАК Этап,
		|	тзКомплекты.ДатаОкончанияПлан КАК ДатаОкончанияПлан,
		|	тзКомплекты.ДатаНачалаПлан КАК ДатаНачалаПлан,
		|	тзКомплекты.Комплект.Проект КАК Проект
		|ИЗ
		|	тзКомплекты КАК тзКомплекты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Б24_СМ_ИдентификаторыОбъектов КАК Б24_СМ_ИдентификаторыОбъектов
		|		ПО тзКомплекты.УИД = Б24_СМ_ИдентификаторыОбъектов.ИдентификаторОбъекта
		|ГДЕ
		|	НЕ Б24_СМ_ИдентификаторыОбъектов.Идентификатор = """"";
	
	Запрос.УстановитьПараметр("тзКомплекты", тзКомплекты);
	Выборка = Запрос.Выполнить().Выбрать();
	
	мИзмененныеКомплекты = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		мИзмененныеКомплекты.Добавить(Новый Структура("Проект, Комплект, Этап, ДатаНачалаПлан, ДатаОкончанияПлан",
		Выборка.Сделка, Выборка.Комплект, Выборка.Этап, Выборка.ДатаНачалаПлан, Выборка.ДатаОкончанияПлан));	
	КонецЦикла;
	
	
	Для каждого текДанные Из мИзмененныеКомплекты Цикл
		
		ТипКомплекта = типЗнч(текДанные.Комплект);
		
		Если ТипКомплекта = ТипИзделияКомплект Тогда
			мИзделияКомплект.Добавить(Новый Структура("Проект,Комплект",текДанные.Проект,текДанные.Комплект));
			
			Если мКонтроль.Найти(текДанные.Комплект) = Неопределено Тогда
				Источник = текДанные.Комплект.ПолучитьОбъект();
				Отказ = Ложь;
				Б24_СМ_РегистрацияИзмененийСервер.ЗарегистрироватьИзменения(Источник, Ложь, Отказ);
				
				мКонтроль.Добавить(текДанные.Комплект);
			КонецЕсли;
		Иначе
			Продолжить;
			
		КонецЕсли;
	
	КонецЦикла;
	
	омВыгрузкаCRMНаСевере.ВыгрузитьВБитрикс();

	Для каждого ИзделияКомплект Из мИзделияКомплект Цикл
		МенеджерЗаписей = РегистрыСведений.ДатыКомплекта.СоздатьМенеджерЗаписи();
		МенеджерЗаписей.Проект = ИзделияКомплект.Проект;
		МенеджерЗаписей.Комплект = ИзделияКомплект.Комплект;
		МенеджерЗаписей.Прочитать();
		
		НужнаЗаписи = Ложь;
		
		Для каждого текДанные Из мИзмененныеКомплекты Цикл
			Если НЕ текДанные.Комплект = ИзделияКомплект.Комплект Тогда
				Продолжить;	
			КонецЕсли;	
			Если текДанные.Этап = "ТЗ" Тогда
				МенеджерЗаписей.НачалоТЗ 	= текДанные.ДатаНачалаПлан;	
				МенеджерЗаписей.КрайТЗ 		= текДанные.ДатаОкончанияПлан;
				НужнаЗаписи					= Истина;
			ИначеЕсли текДанные.Этап = "ПКД" Тогда
				МенеджерЗаписей.НачалоПКД 	= текДанные.ДатаНачалаПлан;	
				МенеджерЗаписей.КрайПКД 		= текДанные.ДатаОкончанияПлан;
				НужнаЗаписи					= Истина;
			ИначеЕсли текДанные.Этап = "РКД" Тогда
				МенеджерЗаписей.НачалоРКД 	= текДанные.ДатаНачалаПлан;	
				МенеджерЗаписей.КрайРКД 		= текДанные.ДатаОкончанияПлан;
				НужнаЗаписи					= Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НужнаЗаписи Тогда
			МенеджерЗаписей.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого ИзделияКомплект Из мИзделияКомплект Цикл
		МенеджерЗаписей = РегистрыСведений.ДатыКомплектаПроизводство.СоздатьМенеджерЗаписи();
		МенеджерЗаписей.Проект = ИзделияКомплект.Проект;
		МенеджерЗаписей.Комплект = ИзделияКомплект.Комплект;
		МенеджерЗаписей.Прочитать();
		
		НужнаЗаписи = Ложь;
		
		Для каждого текДанные Из мИзмененныеКомплекты Цикл
			Если НЕ (текДанные.Комплект = ИзделияКомплект.Комплект И текДанные.Этап = "Производство") Тогда
				Продолжить;	
			КонецЕсли;
			
			МенеджерЗаписей.НачалоПроизводства	= текДанные.ДатаНачалаПлан;	
			МенеджерЗаписей.КрайПроизводства	= текДанные.ДатаОкончанияПлан;
			НужнаЗаписи					= Истина;
		КонецЦикла;
		
		
		Если НужнаЗаписи Тогда
			МенеджерЗаписей.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого ИзделияКомплект Из мИзделияКомплект Цикл
		МенеджерЗаписей = РегистрыСведений.ДатыКомплектаМонтаж.СоздатьМенеджерЗаписи();
		МенеджерЗаписей.Проект = ИзделияКомплект.Проект;
		МенеджерЗаписей.Комплект = ИзделияКомплект.Комплект;
		МенеджерЗаписей.Прочитать();
		
		НужнаЗаписи = Ложь;
		
		Для каждого текДанные Из мИзмененныеКомплекты Цикл
			Если НЕ текДанные.Комплект = ИзделияКомплект.Комплект Тогда
				Продолжить;	
			КонецЕсли;	
			Если текДанные.Этап = "Монтаж" Тогда
				МенеджерЗаписей.НачалоМонтажа 	= текДанные.ДатаНачалаПлан;	
				МенеджерЗаписей.КрайМонтажа 	= текДанные.ДатаОкончанияПлан;	
				НужнаЗаписи					= Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		
		Если НужнаЗаписи Тогда
			МенеджерЗаписей.Записать();
		КонецЕсли;
		
	КонецЦикла; 
	
	
КонецПроцедуры 

&НаКлиенте
Процедура Записать(Команда)
	мИзмененныеКомплекты = Новый Массив;
	
	Если ЭтаФорма.СинхронизироватьВсе Тогда
		НайденыеСтроки = ТЗЗадачи;	
	Иначе
		НайденыеСтроки = ТЗЗадачи.НайтиСтроки(Новый Структура("Изменен", Истина));
	КонецЕсли;
	
	Для каждого х Из НайденыеСтроки Цикл 
	    стДанные = Новый Структура("Проект, Комплект, Этап, ДатаНачалаПлан, ДатаОкончанияПлан", );
		ЗаполнитьЗначенияСвойств(стДанные, х);
		
		мИзмененныеКомплекты.Добавить(стДанные);	
		х.Изменен = Ложь;
	КонецЦикла;
	
	Если мИзмененныеКомплекты.Количество() > 0 Тогда
		ЗаписатьНаСервере(мИзмененныеКомплекты);
	КонецЕсли;
	
	Элементы.Записать.Доступность = Ложь;
КонецПроцедуры

#КонецОбласти

#Область Цвет

&НаСервере
Процедура ЗаполнитьЦветаЛегенды()

	тзЦвета = омДиаграммаГанта.ПолучитьТаблицуЦветов();
	Для каждого х Из тзЦвета Цикл
		Если х.НаименованиеЭтапа = "ТЗ" Тогда
			Элементы.ДекорацияТЗ.ЦветФона = х.Цвет;	
		ИначеЕсли х.НаименованиеЭтапа = "РКД" Тогда
			Элементы.ДекорацияРКД.ЦветФона = х.Цвет;
		ИначеЕсли х.НаименованиеЭтапа = "ПКД" Тогда
			Элементы.ДекорацияПКД.ЦветФона = х.Цвет;
		//ИначеЕсли х.НаименованиеЭтапа = "Производство" И НЕ х.ЭтоГруппа Тогда
		//	Элементы.ДекорацияПроизводство.ЦветФона = х.Цвет;
		ИначеЕсли х.НаименованиеЭтапа = "Производство" И НЕ х.ЭтоГруппа Тогда
			Элементы.ДекорацияПроизводствоГр.ЦветФона = х.Цвет;
		//ИначеЕсли х.НаименованиеЭтапа = "Монтаж" И НЕ х.ЭтоГруппа Тогда
		//	Элементы.ДекорацияМонтаж.ЦветФона = х.Цвет;
		ИначеЕсли х.НаименованиеЭтапа = "Монтаж" И НЕ х.ЭтоГруппа Тогда
			Элементы.ДекорацияМонтажГр.ЦветФона = х.Цвет;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ЗаполнитьЦветаЛегенды()

&НаКлиенте
Процедура ДиаграммаТаблицаПриАктивизацииСтроки(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры


#КонецОбласти
